chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mx575f256h.h
PLIB_INLINE SFR_DATA _TMR_PERIOD_REGISTER_16BIT_HIGH_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_5 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_VALUE_REGISTER_16BIT_HIGH_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_5 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/tmr_GatedTimeAccumulation_Default.h"
#include "../templates/tmr_ClockSource_Default.h"
#include "../templates/tmr_ClockSource_Unsupported.h"
#include "../templates/tmr_Prescale_Default.h"
#include "../templates/tmr_ClockSourceSync_Inverted.h"
#include "../templates/tmr_ClockSourceSync_Unsupported.h"
#include "../templates/tmr_Mode16Bit_Unsupported.h"
#include "../templates/tmr_Mode16Bit_Default.h"
#include "../templates/tmr_Mode32Bit_Unsupported.h"
#include "../templates/tmr_Mode32Bit_Default.h"
#include "../templates/tmr_EnableControl_Default.h"
#include "../templates/tmr_StopInIdle_Default.h"
#include "../templates/tmr_Counter16Bit_In16BitRegister.h"
#include "../templates/tmr_Counter32Bit_Unsupported.h"
#include "../templates/tmr_Counter32Bit_In16BitRegister.h"
#include "../templates/tmr_Counter32Bit_In16BitRegister_high.h"
#include "../templates/tmr_Period16Bit_Default.h"
#include "../templates/tmr_Period32Bit_Unsupported.h"
#include "../templates/tmr_Period32Bit_In16BitRegister_pic32.h"
#include "../templates/tmr_Period32Bit_In16BitRegister_high.h"
#include "../templates/tmr_CounterAsyncWriteControl_Default.h"
#include "../templates/tmr_CounterAsyncWriteControl_Unsupported.h"
#include "../templates/tmr_CounterAsyncWriteInProgress_Default.h"
#include "../templates/tmr_CounterAsyncWriteInProgress_Unsupported.h"
#include "../templates/tmr_TimerOperationMode_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_TMR_GateEnable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_GateEnable_Default(index);
            break;
        case TMR_ID_2 :
            TMR_GateEnable_Default(index);
            break;
        case TMR_ID_4 :
            TMR_GateEnable_Default(index);
            break;
        case TMR_ID_3 :
            TMR_GateEnable_Default(index);
            break;
        case TMR_ID_5 :
            TMR_GateEnable_Default(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_TMR_GateDisable(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_GateDisable_Default(index);
            break;
        case TMR_ID_2 :
            TMR_GateDisable_Default(index);
            break;
        case TMR_ID_4 :
            TMR_GateDisable_Default(index);
            break;
        case TMR_ID_3 :
            TMR_GateDisable_Default(index);
            break;
        case TMR_ID_5 :
            TMR_GateDisable_Default(index);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsGatedTimeAccumulation(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsGatedTimeAccumulation_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsGatedTimeAccumulation_Default(index);
        case TMR_ID_4 :
            return TMR_ExistsGatedTimeAccumulation_Default(index);
        case TMR_ID_3 :
            return TMR_ExistsGatedTimeAccumulation_Default(index);
        case TMR_ID_5 :
            return TMR_ExistsGatedTimeAccumulation_Default(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_ClockSourceSelect(TMR_MODULE_ID index, TMR_CLOCK_SOURCE source)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_ClockSourceSelect_Default(index, source);
            break;
        case TMR_ID_2 :
            TMR_ClockSourceSelect_Unsupported(index, source);
            break;
        case TMR_ID_4 :
            TMR_ClockSourceSelect_Unsupported(index, source);
            break;
        case TMR_ID_3 :
            TMR_ClockSourceSelect_Unsupported(index, source);
            break;
        case TMR_ID_5 :
            TMR_ClockSourceSelect_Unsupported(index, source);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_TMR_ExistsClockSource(TMR_MODULE_ID index)
{
    switch (index) {
        case TMR_ID_1 :
            return TMR_ExistsClockSource_Default(index);
        case TMR_ID_2 :
            return TMR_ExistsClockSource_Unsupported(index);
        case TMR_ID_4 :
            return TMR_ExistsClockSource_Unsupported(index);
        case TMR_ID_3 :
            return TMR_ExistsClockSource_Unsupported(index);
        case TMR_ID_5 :
            return TMR_ExistsClockSource_Unsupported(index);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_TMR_PrescaleSelect(TMR_MODULE_ID index, TMR_PRESCALE prescale)
{
    switch (index) {
        case TMR_ID_1 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_2 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_4 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_3 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_ID_5 :
            TMR_PrescaleSelect_Default(index, prescale);
            break;
        case TMR_NUMBER_OF_MODULES :
        default :
            break;
    }
}

